experiments/2026-08-18-qwen-qwen3-8b-v1-5fa1f7e/vllm__ragged-native.log
INFO 08-18 17:17:36 [importing.py:53] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-18 17:17:36 [importing.py:88] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 08-18 17:17:38 [main.py:71] Unspecified platform detected, switching to CPU Platform instead.
WARNING 08-18 17:17:38 [cpu.py:440] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x720ca0d047c0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0.75', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://vllm:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='vllm__ragged-native.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-ae8dba64-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 17:17:41 [utils.py:90] Sampling input_len from [128, 896] and output_len from [128, 896]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  18.79     
Total input tokens:                      51917     
Total generated tokens:                  55471     
Request throughput (req/s):              5.32      
Output token throughput (tok/s):         2951.62   
Peak output token throughput (tok/s):    5531.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          5714.13   
---------------Time to First Token----------------
Mean TTFT (ms):                          2058.23   
Median TTFT (ms):                        2001.96   
P99 TTFT (ms):                           3962.25   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.98     
Median TPOT (ms):                        21.04     
P99 TPOT (ms):                           34.42     
---------------Inter-token Latency----------------
Mean ITL (ms):                           20.81     
Median ITL (ms):                         18.35     
P99 ITL (ms):                            151.16    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13579.13  
Median E2EL (ms):                        13984.13  
P99 E2EL (ms):                           18770.19  
==================================================

--- stderr ---
W0818 17:17:36.704000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:06<10:28,  6.35s/it]
  3%|▎         | 3/100 [00:06<02:50,  1.76s/it]
  7%|▋         | 7/100 [00:06<00:57,  1.61it/s]
  8%|▊         | 8/100 [00:07<00:50,  1.83it/s]
  9%|▉         | 9/100 [00:07<00:42,  2.14it/s]
 12%|█▏        | 12/100 [00:07<00:26,  3.31it/s]
 13%|█▎        | 13/100 [00:07<00:24,  3.62it/s]
 16%|█▌        | 16/100 [00:08<00:18,  4.55it/s]
 17%|█▋        | 17/100 [00:08<00:20,  4.11it/s]
 20%|██        | 20/100 [00:08<00:12,  6.24it/s]
 21%|██        | 21/100 [00:09<00:14,  5.46it/s]
 23%|██▎       | 23/100 [00:09<00:13,  5.71it/s]
 24%|██▍       | 24/100 [00:10<00:19,  3.93it/s]
 25%|██▌       | 25/100 [00:10<00:19,  3.79it/s]
 26%|██▌       | 26/100 [00:10<00:19,  3.78it/s]
 28%|██▊       | 28/100 [00:11<00:16,  4.37it/s]
 29%|██▉       | 29/100 [00:11<00:16,  4.36it/s]
 30%|███       | 30/100 [00:11<00:15,  4.44it/s]
 32%|███▏      | 32/100 [00:11<00:10,  6.26it/s]
 33%|███▎      | 33/100 [00:11<00:10,  6.64it/s]
 35%|███▌      | 35/100 [00:11<00:07,  8.31it/s]
 37%|███▋      | 37/100 [00:12<00:06,  9.49it/s]
 39%|███▉      | 39/100 [00:12<00:05, 10.36it/s]
 41%|████      | 41/100 [00:12<00:07,  7.43it/s]
 42%|████▏     | 42/100 [00:12<00:07,  7.59it/s]
 44%|████▍     | 44/100 [00:13<00:08,  6.86it/s]
 46%|████▌     | 46/100 [00:13<00:06,  8.56it/s]
 48%|████▊     | 48/100 [00:13<00:08,  6.43it/s]
 49%|████▉     | 49/100 [00:13<00:08,  5.85it/s]
 51%|█████     | 51/100 [00:14<00:06,  7.11it/s]
 52%|█████▏    | 52/100 [00:14<00:09,  4.90it/s]
 53%|█████▎    | 53/100 [00:14<00:08,  5.53it/s]
 55%|█████▌    | 55/100 [00:14<00:06,  6.69it/s]
 56%|█████▌    | 56/100 [00:14<00:06,  7.05it/s]
 57%|█████▋    | 57/100 [00:15<00:06,  6.31it/s]
 59%|█████▉    | 59/100 [00:15<00:06,  6.71it/s]
 60%|██████    | 60/100 [00:15<00:06,  6.34it/s]
 61%|██████    | 61/100 [00:15<00:06,  5.68it/s]
 62%|██████▏   | 62/100 [00:16<00:07,  4.93it/s]
 64%|██████▍   | 64/100 [00:16<00:05,  6.41it/s]
 67%|██████▋   | 67/100 [00:16<00:03, 10.18it/s]
 70%|███████   | 70/100 [00:16<00:02, 12.72it/s]
 72%|███████▏  | 72/100 [00:16<00:02, 13.02it/s]
 74%|███████▍  | 74/100 [00:17<00:03,  7.44it/s]
 77%|███████▋  | 77/100 [00:17<00:02,  8.66it/s]
 79%|███████▉  | 79/100 [00:17<00:02,  8.90it/s]
 82%|████████▏ | 82/100 [00:17<00:01, 11.38it/s]
 84%|████████▍ | 84/100 [00:17<00:01, 12.41it/s]
 86%|████████▌ | 86/100 [00:18<00:01, 11.31it/s]
 89%|████████▉ | 89/100 [00:18<00:00, 14.33it/s]
 94%|█████████▍| 94/100 [00:18<00:00, 15.66it/s]
 97%|█████████▋| 97/100 [00:18<00:00, 17.05it/s]
100%|██████████| 100/100 [00:18<00:00,  5.32it/s]